import img1 from "../assets/images/img-1.jpg";
import img2 from "../assets/images/img-2.jpg";
import img3 from "../assets/images/img-3.jpg";
import img4 from "../assets/images/img-4.jpg";
import img5 from "../assets/images/img-5.jpg";

export const trips = [
    {
        id: 1,
        name: "ไหว้พระขอพรจากเที่ยวเชียงใหม่-ลำปาง",
        tag: 1,
        description: "เดินทางไหว้ไปวัดต่างๆ ตั้งแต่เชียงใหม่ถึงลำปาง ",
        image: img1,
        origin: "เมืองเชียงใหม่",
        destination: "เมืองลำปาง",
        landmark: "วัดพระธาตุลำปางหลวง",
        duration: "2 วัน 1 คืน",
        price: "1000",
        fee: "5"
    },
    {
        id: 2,
        name: "กลางสู่อีสาน",
        tag: 1,
        description: "เดินทางไหว้ไปวัดต่างๆ ตั้งแต่ออกจากกรุงเทพถถึงสุดอีสานตอนล่าง อย่างจังหวัดอุบลราชธานี พร้อมดื่มดำ่ไปกับธรรมชาติ ",
        image: img2,
        origin: "กรุงเทพ",
        destination: "เมืองอุบล",
        landmark: "วัดสิรินธรวรารามภูพร้าว",
        duration: "3 วัน 2 คืน",
        price: "2000",
        fee: "7"
    },
    {
        id: 6,
        name: "เที่ยวเชียงใหม่ตามใจฉัน",
        tag: 2,
        description: "ท่องเที่ยวเดินทางชมวิวไปตามสถานที่ต่างในเชียงใหม่",
        image: img5,
        origin: "กรุงเทพ",
        destination: "เชียงใหม่",
        landmark: "สถานีรถไฟขุนตาล",
        duration: "2 วัน 1 คืน",
        price: "3200",
        fee: "5"
    },
    {
        id: 3,
        name: "เที่ยวเชียงใหม่-ลำปาง",
        tag: 2,
        description: "ท่องเที่ยวเดินทางชมวิว ตั้งแต่เชียงใหม่ถึงลำปาง ด้วยรถไฟ",
        image: img3,
        origin: "เมืองเชียงใหม่",
        destination: "เมืองลำปาง",
        landmark: "สถานีรถไฟขุนตาล",
        duration: "2 วัน 1 คืน",
        price: "1200",
        fee: "5"
    },
    {
        id:4,
        name: "ล่องเรือกลางแม่น้ำเจ้าพระยา",
        tag: 2,
        description: "ชมวิวแม่น้ำเจ้าพระยา ด้วยเรือท่องเที่ยว",
        image: img4,
        origin: "เมืองเชียงใหม่",
        destination: "เมืองลำปาง",
        landmark: "สะพานพระราม 9",
        duration: "1 วัน 1 คืน",
        price: "1000",
        fee: "4"
    },
    {
        id:5,
        name: "เที่ยวใกล้กรุง",
        tag: 2,
        description: "สูดบรรยากาศนอกเมื่อยามว่าง",
        image: img5,
        origin: "กรุงเทพ",
        destination: "นครปฐม",
        landmark: "",
        duration: "1 วัน",
        price: "500",
        fee: "2.1"
    }

]


/*
20.15 -  9.15 ขึ้นรถไฟขบวน 13 ที่สถานีกลางกรุงเทพฯอภิวัฒน์ - สถานีเชียงใหม่
9:15 - 9.30 ออกรถแดงไปรอคิวรถตรงประตูเชียงใหม่
9.30 - 9.40 นั่งรถเหลืองไปยังจอมทองเช่ามอเตอร์ไซค์
9.40 - 10.10 กินข้าวซอยแก้วน้อย
10.10 - 10.30 เที่ยวคาเฟ่ที่เง็กกี
10.30 - 11.40 ขี่มอไซไปอุทยานแห่งชาติดอยอินทนนท์
11.40 - 12.00 ขี่มอไซไปน้ำตกวัชชีรทาน 
12.00 - 13.30 เล่นน้ำตก
13.30 - 14.00 ขี่มอเตอร์ไซค์ไปวีระศักดิ์โฮมสเตย์
14.30 - 15.00 กินอาหารของโฮมสเตย์
Free time 
แนะนำ ชมนาขั้นบันได เที่ยวดอยอินทนนท์
8.30-9.00  กินอาหารของโฮมสเตย์
9.00-9.30 ขี่มอไซไปร้านกาแฟลุงสมศักดิ์
9.30 - 10.00 กินกาแฟร้านกาแฟลุงสมศักดิ์
10.00 - 11.00 ขับรถเข้าจอมทอง แล้วเอารถไปคืน
11.00 - 12.00 ไหว้พระที่วัดพระธาตุ 4 จอมทองวรวิหาร
12.00 - 12.30 ขึ้นรถเหลืองและเดินต่อไปคลองแม่ข่า 
12.30 - 14.30 เดินเที่ยวที่คลองแม่ข่า
14.30 - 15.00 ขึ้นมอไซไปที่สถานีเชียงใหม่
15.00 - 16.00 เดินกินข้าวที่สถานีเชียงใหม่
16.00 ขึ้นรถไฟขบวน14
*/ 
export const timeLines = [
 {
    id:6,
    timeline : [
        {
            time: "20.15",
            detail: "ขึ้นรถไฟขบวน 13 ที่สถานีกลางกรุงเทพฯอภิวัฒน์ - สถานีเชียงใหม่"
        },
        {
            time: "9.15",
            detail: "ออกรถแดงไปรอคิวรถตรงประตูเชียงใหม่"
        },
        {
            time: "9.30",
            detail: "นั่งรถเหลืองไปยังจอมทองเช่ามอเตอร์ไซค์"
        },
        {
            time: "9.40",
            detail: "กินข้าวซอยแก้วน้อย"
        },
        {
            time: "10.10",
            detail: "เที่ยวคาเฟ่ที่เง็กกี"
        },
        {
            time: "10.30",
            detail: "ขี่มอไซไปอุทยานแห่งชาติดอยอินทนนท์"
        },
        {
            time: "11.40",
            detail: "ขี่มอไซไปน้ำตกวัชชีรทาน"
        },
        {
            time: "12.00",
            detail: "เล่นน้ำตก"
        },
        {
            time: "13.30",
            detail: "ขี่มอเตอร์ไซค์ไปวีระศักดิ์โฮมสเตย์"
        },
        {
            time: "14.30",
            detail: "กินอาหารของโฮมสเตย์"
        },
        {
            time: "Free time",
            detail: "แนะนำ ชมนาขั้นบันได เที่ยวดอยอินทนนท์"
        },
        {
            time: "8.30",
            detail: "กินอาหารของโฮมสเตย์"
        },
        {
            time: "9.00",
            detail: "ขี่มอไซไปร้านกาแฟลุงสมศักดิ์"
        },
        {
            time: "9.30",
            detail: "กินกาแฟร้านกาแฟลุงสมศักดิ์"
        },
        {
            time: "10.00",
            detail: "ขับรถเข้าจอมทอง แล้วเอารถไปคืน"
        },
        {
            time: "11.00",
            detail: "ไหว้พระที่วัดพระธาตุ 4 จอมทองวรวิหาร"
        },
        {
            time: "12.00",
            detail: "ขึ้นรถเหลืองและเดินต่อไปคลองแม่ข่า"
        },
        {
            time: "12.30",
            detail: "เดินเที่ยวที่คลองแม่ข่า"
        },
        {
            time: "14.30",
            detail: "ขึ้นมอไซไปที่สถานีเชียงใหม่"
        },
        {
            time: "15.00",
            detail: "เดินกินข้าวที่สถานีเชียงใหม่"
        },
        {
            time: "16.00",
            detail: "ขึ้นรถไฟขบวน14"
        }
    ]
 }
]
